<center><h2> Estrutura de Dados
</center>

<b>Exercicio 1.</b> Hummm interessante, agora que vimos nossa primeira estrutura de dados, vamos fazer um exercicio bem legal.
Voce tem uma tupla chamada feira.
A feira contém: banana, pera, batata, uva, cebola, alho e açucar.

Teu chefe te mandou a feira, e pediu para voce contrar esses produtos, um deles não da para comprar lá remova ele da lista. No caminho ele te ligou mandou voce também comprar maça e cenoura.

Ele é mega chato, e mandou voce separar em duas sacolas, o que é fruta e o que é legume e entregar tudo ordenado.

<b>feira = "banana", "pera", "batata", "uva", "cebola", "alho", "açucar""</b>

In [9]:
#instanciando as listas
feira = ["banana","pera","batata","uva","cebola","alho","açucar"]
fruta=[]
legume=[]

#removendo e adicionando itens na lista
feira.remove("açucar")
feira.append("maça")
feira.append("cenoura")

#laço para separar frutas de legumes e colocar nas suas devidas listas
for n in feira:
    if (n == "banana" or n=="pera" or n=="uva" or n=="maça"):
        fruta.append(n)
    else:
        legume.append(n)
        
#Ordenar feira itens e legumes
fruta.sort()
legume.sort()

#Exibir itens e legumes
print(feira)
print(fruta)
print(legume)

['banana', 'pera', 'batata', 'uva', 'cebola', 'alho', 'maça', 'cenoura']
['banana', 'maça', 'pera', 'uva']
['alho', 'batata', 'cebola', 'cenoura']

<b>Exercicio2.</b> Lista: (4,5,3,4,56,3,2,31,1,7,8,9,0,234,7,8,9). Ordene a lista mostre os valores repetidos.

In [31]:
#instanciando as listas
numeros=[4,5,4,56,3,2,31,1,7,8,9,0,234,7,8,9]
naorepetidos= []
repetidos=[]
#ordenando a lista
numeros.sort()

#Laço para exibir somente os valores repetidos
#Se item não estiver na lista naorepetidos incluir esse item na lista, caso contrário é um numero repetido então inclui 
#na lista repetidos.

for n in numeros:
    if (n not in naorepetidos):
        naorepetidos.append(n)
    else:
        repetidos.append(n)
print (numeros)            
print (repetidos)

[0, 1, 2, 3, 4, 4, 5, 7, 7, 8, 8, 9, 9, 31, 56, 234]
[4, 7, 8, 9]

<b>Exercicio3.</b> Vamos voltar a feira, crie um dicionario, com os seguintes itens: banana = 0.98, maçã = 7.00, pera = 5.00, cenoura = 3.5

In [35]:
#criando o dicionário
sacola = dict({"banana": 0.98, "maça": 7.00, "pera": 5.00, "cenoura": 3.5})

#laço para exibir a chave e o valor do dicionário  
for chave,valor in sacola.items():
    print(chave,valor)

banana 0.98
maça 7.0
pera 5.0
cenoura 3.5

<center><h2> Estrutura de Dados (PANDAS)
</center>

In [37]:
#importando a biblioteca do pandas (https://pandas.pydata.org/)
import pandas as pd

# Lendo o arquivo titanic
titanic_df = pd.read_csv('C:/Users/Ludmi/Documents/AulaPhyton/ling-ds-engenharia/python-ead/dataset/titanic.csv')

#com o metodo head, podemos ler a quantidade de linhas que desejamos.
titanic_df.head(3)

#já com o shape, podemos avaliar a estrutura do arquivo
titanic_df.shape

(891, 12)

<b>Exercicio.</b>
1. com o shape, podemos avaliar a estrutura do arquivo. Repare na resposta que ele parece um array. Imagine que gostariamos apenas de retornar a quantidade de linhas, como podemos fazer?

In [4]:
titanic_df.shape[0]

891

2. com o metodo head, retornamos a quantiade de linhas do arquivo de cima para baixo, se queremos de baixo para cima, executamos o metodo tail. Execute ele.

In [11]:
titanic_df.tail(3)

PassengerId                                                 2670
Survived                                                       1
Pclass                                                         7
Name           Johnston, Miss. Catherine Helen "Carrie"Behr, ...
Sex                                               femalemalemale
Age                                                           58
SibSp                                                          1
Parch                                                          2
Ticket                                    W./C. 6607111369370376
Fare                                                        61.2
Embarked                                                     SCQ
dtype: object

3. tire a porcentagem de dados nulos

In [6]:
round((titanic_df.isnull().sum() * 100) / titanic_df.shape[0],2)

PassengerId     0.00
Survived        0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            19.87
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.00
Cabin          77.10
Embarked        0.22
dtype: float64

4. Nesta etapa quero que vc crie um novo dataframe, uma variavel, ela só poderá ter pessoas do sexo masculino e que tenham mais que 35 anos de idade.

In [40]:
titanic2 = titanic_df.loc[(titanic_df.Age>=35) & (titanic_df.Sex =='male') ]

In [41]:
titanic2.head(4)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,39.0,1,5,347082,31.2750,NaN,S
20,21,0,2,"Fynney, Mr. Joseph J",male,35.0,0,0,239865,26.0000,NaN,S

5. Renomei todas as colunas, conforme seu entendimento

In [42]:
titanic_df = titanic_df.rename(columns={"Age": "Idade", "Name":"Nome", "Sex": "Sexo"})

In [43]:
titanic_df.head(4)

,PassengerId,Survived,Pclass,Nome,Sexo,Idade,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S

6.Crie um novo dataframe, porém somente com as colunas: Survived, Pclass, Sex, Age, Ticket, Embarked

In [44]:
titanic3=titanic_df[['Survived', 'Pclass', 'Sexo', 'Idade', 'Ticket', 'Embarked']]

In [45]:
titanic3.head(5)

   Survived  Pclass    Sexo  Idade            Ticket Embarked
0         0       3    male   22.0         A/5 21171        S
1         1       1  female   38.0          PC 17599        C
2         1       3  female   26.0  STON/O2. 3101282        S
3         1       1  female   35.0            113803        S
4         0       3    male   35.0            373450        S

7. Faça um groupby, e retorne somente as idades. Quero que forme faixas

In [57]:
titanic_df['Contador'] = 1
titanic_df.head(5)

,PassengerId,Survived,Pclass,Nome,Sexo,Idade,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Contador
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,1

In [58]:
titanic_df[['Idade', 'Contador']].groupby("Idade").sum()

       Contador
Idade
0.42          1
0.67          1
0.75          2
0.83          2
0.92          1
...         ...
70.00         2
70.50         1
71.00         2
74.00         1
80.00         1

[88 rows x 1 columns]